{
  "cust0": {
    "income": 50000,
    "age": 30,
    "plans": [
      "Suggested plan for cust0 based on context: Customer Profile Document\nThis is Mr. Arjun Sharma, a 30-year-old self-employed professional from India. He is\nmarried and supports two dependents. His annual income is approximately ₹3.55 lakhs,\nplacing him in the low salary bracket. His monthly household expenses are around\n₹11,063, which have been increasing at an average rate of 6.08% per year. Arjun’s savings\nrate is relatively low at 22.13%, while he continues to manage a small loan EMI obligation\nof ₹17,000. His current net worth stands at ₹9.49 lakhs, giving him a debt-to-income ratio of\n0.37. He maintains a credit score of 794, categorized as very good, and is classified as\nhaving a high risk-taking ability. Arjun has 3.2 years of investment experience and a\nfinancial knowledge score of 7.4/10. However, his past investment returns have been\nnegative (-17.03%), likely due to volatile equity exposure. He generally prefers a\nmedium-term investment horizon.\nLoan / Liability Summary\nArjun has a small liability portfolio. His monthly loan EMI payment is ₹17,000, though\nspecific details of loan type are not recorded here. This remains active and is factored into\nhis expense planning.\nInsurance Coverage Summary\nArjun maintains robust insurance protection relative to his income. He holds a health\ninsurance policy worth ₹99,600, and a life insurance cover of ₹42.64 lakhs, which is\nnearly 120× his annual income, placing him under the “Both” category with High\ninsurance times. He also keeps an emergency fund of ₹88,500, primarily in savings and\nliquid instruments.\nInvestment Product Sheet\nArjun’s portfolio allocation demonstrates a strong tilt toward equities. His wealth is distributed\nas follows:\n● Real Estate: 12.49%\n● Equity: 55.62%\n● Debt: 10.74%\n● Cash / Liquid: 14.68% ● Gold: 6.47%\nCurrently, his main investment type is in mutual funds, though volatility has caused his\nportfolio to underperform. Despite his financial knowledge, Arjun’s portfolio experienced\nlosses due to high exposure to equities during market downturns.\nFinancial Goal Templates\nArjun’s primary financial goal is retirement planning, with a target corpus of ₹54.97 lakhs\nto be accumulated over the next 14 years.\nMacro & Risk Factors\nArjun’s financial history shows moderate external impacts:\n● Pandemic Impact Factor: -0.091 (minor negative effect on income stability)\n● War Impact Factor: -0.016 (low exposure)\n● Inflation Rate at Investment Start: 5.11%\n● GDP Growth Rate at Investment Start: 6.04%\n● Market Volatility Index: 26.3 (high volatility phase)\nRegulatory & Guidelines\nBased on SEBI’s investor profiling, Arjun is classified as a High Risk Investor, given his\nstrong equity exposure and willingness to accept volatility. His life insurance cover far\nexceeds IRDAI norms (≥5× income), putting him in a safe bracket. For financial planning\npurposes, an inflation range of 6–8% should be applied to his retirement projections. Loan Information Document\nThis document provides a summary of the various loan products available to customers,\nalong with their key features, repayment structures, and eligibility guidelines.\n1. Home Loan\n● Purpose: Purchase, construction, or renovation of a residential property.\n● Loan Amount: Up to 80–90% of property value.\n● Interest Rate: 7% – 9% (floating or fixed, repo-linked).\n● Tenure: Up to 30 years.\n● Collateral: Mortgaged property.\n● Repayment: Equated Monthly Installments (EMIs).\n● Prepayment: Allowed, may attract a nominal charge.\n● Special Note: Tax benefits available under Income Tax Act (Sections 24 & 80C).\n2. Car Loan\n● Purpose: Purchase of new or used cars.\n● Loan Amount: 75–90% of on-road vehicle cost.\n● Interest Rate: 7.5% – 10% (fixed).\n● Tenure: 3–7 years.\n● Collateral: Hypothecation of the car.\n● Repayment: Monthly EMIs linked to tenure.\n● Insurance Requirement: Comprehensive motor insurance mandatory. 3. Education Loan\n● Purpose: Funding higher studies in India or abroad.\n● Loan Amount: ₹5 lakh – ₹40 lakh (depending on institution & program).\n● Interest Rate: 8% – 11%.\n● Tenure: 5–15 years.\n● Collateral: Required for higher amounts; parental/guardian co-borrower mandatory.\n● Moratorium: EMI begins after course completion + 6–12 months.\n● Subsidy: Eligible students may avail government interest subsidies.\n4. Personal Loan\n● Purpose: Medical expenses, weddings, travel, or emergencies.\n● Loan Amount: ₹50,000 – ₹25 lakh.\n● Interest Rate: 10% – 18%.\n● Tenure: 1–5 years.\n● Collateral: None (unsecured loan).\n● Repayment: Fixed monthly EMIs.\n● Special Note: Higher interest due to unsecured nature.\n5. Business Loan\n● Purpose: Working capital, expansion, purchase of equipment.\n● Loan Amount: ₹5 lakh – ₹5 crore (depending on business scale).\n● Interest Rate: 9% – 15%.\n● Tenure: 1–15 years. ● Collateral: Property, machinery, or inventory (sometimes unsecured for small ticket).\n● Repayment: Structured EMIs or flexible repayment linked to business revenues.\n6. Gold Loan\n● Purpose: Short-term liquidity by pledging gold ornaments or coins.\n● Loan Amount: Up to 75% of gold value.\n● Interest Rate: 7% – 12%.\n● Tenure: 6–36 months.\n● Collateral: Gold pledged with bank.\n● Repayment: Bullet repayment or EMIs.\n● Special Note: Quick disbursal, minimal documentation.\n7. Overdraft / Credit Line\n● Purpose: Flexible borrowing for salaried and self-employed.\n● Loan Limit: Based on income/net worth.\n● Interest Rate: 9% – 14%.\n● Tenure: Renewable annually.\n● Collateral: May be unsecured or backed by deposits/property.\n● Repayment: Interest payable only on utilized amount.\nGeneral Loan Guidelines\n1. Eligibility: Based on age (21–60 years), income stability, credit score, and\nrepayment history. 2. Credit Score Impact: Loans are subject to minimum score requirements (usually ≥\n700). Lower scores may attract higher rates.\n3. Default Penalty: Late payments attract penalty charges and adversely affect credit\nscore.\n4. Prepayment Rules: Most loans allow partial or full prepayment after 6–12 months;\nfees may apply.\n5. Insurance Requirement: For secured loans (home, car, business), insurance of the\nasset is mandatory.\n6. Debt-to-Income Ratio: Total EMI obligations should not exceed 35–40% of monthly\nincome. Customer Profile Document\nThis is Ms. Neha Verma, a 42-year-old marketing consultant based in Mumbai. She is\nmarried and has one dependent, her teenage daughter. Neha earns an annual income of\n₹14.8 lakhs, placing her in the upper-middle salary bracket. Her monthly household\nexpenses average ₹65,000, with an expense growth rate of about 6.5%. She maintains a\nsavings rate of nearly 28%, resulting in a current net worth of ₹72 lakhs. Neha has a\ncredit score of 768, shows a moderate to high risk-taking ability, and has 12 years of\ninvestment experience. Her financial knowledge is strong (8/10), and her past investments\nhave yielded an average 10.2% CAGR. She prefers a long-term investment horizon of 20\nyears.\nLoan / Liability Summary\nNeha is managing a few ongoing liabilities:\n1. Home Loan – In 2016, Neha purchased a 2BHK apartment in Mumbai with a\nhousing loan of ₹55 lakhs at an interest rate of 7.3% (floating). Her tenure is 25\nyears, and she pays a monthly EMI of about ₹40,200. The property itself is\nmortgaged as collateral, and the loan is expected to close in 2041.\n2. Education Loan (Co-borrower) – She co-signed an education loan of ₹8 lakhs for\nher younger brother’s MBA in 2019. The loan has an interest rate of 9.5%, a tenure\nof 10 years, and EMIs of around ₹10,500, shared between her and her brother.\n3. Personal Loan – In 2021, Neha took a personal loan of ₹3 lakhs for medical\nexpenses. The loan carries a 12.2% interest rate over 3 years, with monthly EMIs\nof ₹10,000. This is scheduled to close by the end of 2024.\nTotal Loan Burden: ~₹63,000 per month, which is about 36% of her monthly income —\nwithin manageable limits.\nInsurance Coverage Summary\nNeha holds adequate insurance coverage across life, health, and assets:\n● Life Insurance: A term plan with ₹1.5 crore cover for 25 years from HDFC Life.\nPremium: ~₹1,800/month. Nominee: her spouse.\n● Health Insurance: Family floater policy from Star Health worth ₹20 lakhs, covering\nNeha, her spouse, and her daughter. Premium: ~₹26,000 annually. ● Motor Insurance: Comprehensive insurance for her Hyundai Venue with coverage\nequal to the car’s Insured Declared Value (₹9.5 lakhs). Premium: ~₹18,000/year.\n● Emergency Fund: ₹6.2 lakhs maintained in liquid mutual funds and high-interest\nsavings.\n● Insurance Type: Both health and life.\n● Insurance Times: Medium (≈10× annual income).\nInvestment Product Sheet\nNeha’s portfolio allocation is diversified with a growth tilt:\n● Equity: 45% (₹32.5 lakhs across SIPs, blue-chip stocks, and index funds).\n● Debt: 20% (₹14.5 lakhs in PPF, corporate bonds, and fixed deposits).\n● Real Estate: 25% (₹18 lakhs in a small commercial property investment).\n● Gold: 5% (₹3.6 lakhs in Sovereign Gold Bonds).\n● Cash / Liquid: 5% (₹3.6 lakhs).\nHer overall portfolio has historically delivered 10–11% CAGR, consistent with her risk\nappetite.\nFinancial Goal Templates\n● Primary Goal: Daughter’s higher education abroad – Target ₹70 lakhs in 8 years.\n● Secondary Goal: Retirement planning – Target ₹4 crore in 18 years.\nMacro & Risk Factors\n● Pandemic Impact Factor: Medium (work contracts slowed in 2020).\n● War Impact Factor: Low (slight increase in gold value helped her portfolio). ● Inflation at Investment Start: 6.8%.\n● GDP Growth Rate: 6.3%.\n● Market Volatility Index: 21.\nRegulatory & Guidelines\n● According to SEBI’s risk classification, Neha is a Moderate-High Risk Investor,\nas her equity allocation is above 40%.\n● Her life insurance cover of ₹1.5 crore is more than 10× her annual income, meeting\nIRDAI’s recommended norms.\n● For goal projections, an inflation adjustment of 6–8% should be considered in all\nfinancial plans.{'income': 50000, 'age': 30}"
    ]
  }
}